#include "vulkan_local.h"

i32
GroundPipelineBuildDensities(file_contents * Files)
{
    ground_info * Ground = &GlobalVulkan.GroundInfo;

    VkDescriptorSetLayoutBinding LayoutBinding = 
        VH_CreateDescriptorSetLayoutBinding(0,
                VK_DESCRIPTOR_TYPE_STORAGE_BUFFER,
                VK_SHADER_STAGE_COMPUTE_BIT);

    VkDescriptorSetLayoutBinding DescriptorSetLayoutBindings[] = 
    {
        LayoutBinding
    };

    VkDescriptorSetLayoutCreateInfo SetInfo;
    SetInfo.sType        = VK_STRUCTURE_TYPE_DESCRIPTOR_SET_LAYOUT_CREATE_INFO; // VkStructureType   sType;
    SetInfo.pNext        = 0; // Void * pNext;
    SetInfo.flags        = 0; // VkDescriptorSetLayoutCreateFlags   flags;
    SetInfo.bindingCount = ArrayCount(DescriptorSetLayoutBindings); // uint32_t   bindingCount;
    SetInfo.pBindings    = &DescriptorSetLayoutBindings[0]; // Typedef * pBindings;

    VK_CHECK(vkCreateDescriptorSetLayout(GlobalVulkan.PrimaryDevice,&SetInfo,nullptr,&GlobalVulkan.GroundInfo.SetLayoutDensityVolume));

    // BUILD POOL
    VkDescriptorPoolSize DescriptorPoolSizes[] =
	{
        { VK_DESCRIPTOR_TYPE_UNIFORM_BUFFER_DYNAMIC, 10 },
        { VK_DESCRIPTOR_TYPE_STORAGE_BUFFER, 10 }
	};

	VkDescriptorPoolCreateInfo PoolInfo = {};
	PoolInfo.sType = VK_STRUCTURE_TYPE_DESCRIPTOR_POOL_CREATE_INFO;
	PoolInfo.flags = 0;
	PoolInfo.maxSets = 10;
	PoolInfo.poolSizeCount = ArrayCount(DescriptorPoolSizes);
	PoolInfo.pPoolSizes = DescriptorPoolSizes;

	vkCreateDescriptorPool(GlobalVulkan.PrimaryDevice, &PoolInfo, nullptr, &Ground->DescriptorPool);
    


    return 0;
}

// gg (ground generation)

struct ground_voxel_LOD
{
   /*0 */r32 VoxelDim;                     // 65;
   /*4 */r32 VoxelDimMinusOne;             // 64;
   /*8 */v2 wsVoxelSize;                   // v2(1.0/64.0, 0); // could be 1/63, 1/31, 1/15 depending on LOD
   /*16 */v2 wsChunkSize;                  // 4. 0;
   /*24 */v2 InvVoxelDim;                   // v2(1.0/65.0, 0);
   /*32 */v2 InvVoxelDimMinusOne;           // v2(1.0/64.0, 0);
   /*36 */r32 Margin;                       // 4;
   /*40 */r32 VoxelDimPlusMargins;          // 73;
   /*44 */r32 VoxelDimPlusMarginsMinusOne;  // 72;
   r32 _Padding01;
   /*48 */v2 InvVoxelDimPlusMargins;        // v2(1.0/73.0, 0);
   /*56 */v2 InvVoxelDimPlusMarginsMinusOne;// v2(1.0/72.0, 0);
};


i32
GroundCreateLayoutGlobals()
{
    VkDescriptorSetLayoutBinding LayoutBindingViewPort = 
        VH_CreateDescriptorSetLayoutBinding(0,
                VK_DESCRIPTOR_TYPE_UNIFORM_BUFFER_DYNAMIC,
                VK_SHADER_STAGE_VERTEX_BIT);

    VkDescriptorSetLayoutBinding LayoutBindingLOD = 
        VH_CreateDescriptorSetLayoutBinding(1,
                VK_DESCRIPTOR_TYPE_UNIFORM_BUFFER_DYNAMIC,
                VK_SHADER_STAGE_VERTEX_BIT);

    VkDescriptorSetLayoutBinding DescriptorSetLayoutBindings[] = 
    {
        LayoutBindingViewPort,
        LayoutBindingLOD
    };

    VkDescriptorSetLayoutCreateInfo SetInfo;
    SetInfo.sType        = VK_STRUCTURE_TYPE_DESCRIPTOR_SET_LAYOUT_CREATE_INFO; // VkStructureType   sType;
    SetInfo.pNext        = 0; // Void * pNext;
    SetInfo.flags        = 0; // VkDescriptorSetLayoutCreateFlags   flags;
